{
    "portfolio": "Portfolio",

    "head.metadata.title": "Portfolio - LX",
    "head.metadata.description": "Frontend developer and UX writer",
    "home.welcome.header": "Hi! Welcome to my page!",

    "home.welcome.text.1": "My name is Dominika and I am a Frontend Developer. Feel free to browse through some of my projects and posts.",
    "home.welcome.text.2": "I hope you enjoy it.",
    "home.projects.header": "My latest projects",
    "home.projects.project1.header": "This website!",
    "home.projects.project1.summary": "This website is my ongoing project. It is based on my first website, built in Wordpress around 2016. The new version has more content and is more aligned with what I currently do, both professionally and as a hobby. I keep on improving the site's design and content. I also add new functionalities to it. Most recently, I have improved the layout of my blog posts and changed the way the latest posts are displayed. In the future, I would like to add some new sections to it and make the entire site responsive (it is currently only partially responsive).",
    "home.projects.project1.technologies": "I have built this website using React.js (React Router, React Intl, etc.), Typescript, and Ant Design. Its prototype was created in Figma. In my design I used Streamline's vector illustrations.",
    "home.projects.project2.header": "Pest monitoring app",
    "home.projects.project2.description": "I am a member of a small team working on the frontend of a platform for monitoring insect pests. The application is mainly used in the farming sector, by fruit and vegetable growers in Spain. It offers such functionalities as advanced reporting, data analysis as well as real-time overview of temperature, humidity, and pest numbers. In the future it will also contain a module using AI to predict the risk of occurence of different types of insect pests.",
    "home.projects.project2.technologies": "I have worked on this app using React.js, Typescript, and Ant Design. Its design was made in Figma. For data visualizations, we have used React Charts library.",
    "home.projects.project3.header": "Debt collection app",
    "home.projects.project3.description": "I was the main frontend developer of a digital tool designed to help individuals and businesses manage and track outstanding debts. This app allows users to record debt details, send automated payment reminders, and communicate with debtors. The app may offer features like payment scheduling, debt reporting, and legal compliance tools to ensure efficient debt recovery. With a user-friendly interface, it simplifies the collection process, reduces administrative tasks, and helps users maintain better cash flow while ensuring timely repayments.",
    "home.projects.project3.technologies": "This web app was built with React.js, Typescript, and Ant Design.",
    "home.technologies.header": "Technologies and tools",
    "home.technologies.description1": "React.js | Javascript | Typescript ",
    "home.technologies.description2": "Figma | Antd | Scss ",
    "home.technologies.description3": "Git | Jira | Confluence",
    "home.technologies.description4": "API | Axios | Markdown",
    "home.contact.header": "Contact me",
    "home.contact.description": "I will be happy to get in touch. Click the button to find my contact details.",
    "home.contact.link": "contact",
    "home.about.link": "about",
    "home.blog.link": "blog",
    "about.header": "A bit about me",
    "about.description1": "After many years of searching for the right profession, I finally love what I do.",
    "about.description2": "I'm Dominika - a Frontend Developer and Technical Writer working remotely from Poland and Spain. I am passionate about creating meaningful, visually-appealing, and impactful web applications.",
    "about.description3": "In my everyday work I use such tools as Jira, Confluence, Visual Studio Code, Swagger, STS, and Bitbucket. I have also recently started to use GitHub to store my personal projects.",
    "about.description4": "Outside of work, I love spending time with my 2 children: David (9) and Sofia (6). I enjoy swimming and running. In my spare time I also like reading books (recently these are mostly IT-related).",
    "blog.header": "Latests posts",
    "blog.description": "I use this space to store my notes on problems encountered in frontend development",
    "blog.post.header.1": "Using Stash",
    "blog.post.description.1": "Has it ever happened to you that you made some changes to the code in one git branch and wanted to apply them in another one? This is what happened to me not so long ago. The answer to my problem was GIT STASH. This git command helps you to temporarily save any uncommited changes (both staged and unstaged). This comes especially handy in cases like mine - when I wanted to store my changes from one branch, switch the branch, and then drop them in a new place. While using stash three commands are worth remembering: git stash (saving the changes), git stash pop (reapplying the previously stashed changes, removing them from stash), and git stash apply (if you would like to do the same, but without removing the changes from stash). I hope you find this info useful just I did!",
    "blog.post.header.2": "How to change fonts in a newly created React project?",
    "blog.post.header.3": "How to add Google icons to a React project?",
    "blog.post.description.3": "Although I normally use antd icons in my project, I must admit they are often not as visually appealing as Google icons. As I am increasingly using Google Material assets in my work, I have been looking for information on how to use Google icons in a React project, without uploading these assets (which can take some space in a project). The process is very simple. First, we import the Google fonts api in our index.html file. Second, we add the material-icons class in our index.css file of the project. To reference an icon in our code, we just need to place their name in a span with a class called material-icons.",
    "newPostComponent.title": "Add a new blog post",
    "blog.sidebar.title": "Latests posts",
    "blog.sidebar.button": "Add a post",
    "footer.legalNotice": "Legal notice",
    "footer.privacyPolicy": "Privacy policy",

    "button.contact": "Contact",
    "button.save": "Save",
    "contact.header": "Contact me",
    "contact.description.1": "Have a question, feedback, or interested in collaborating?",
    "contact.description.2": "Drop me an email. I would love to hear from you."
   



}